app/controllers/tweets_controller.rb

    def index
        @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO `tweets` (`body`, `created_at`, `updated_at`) VALUES ('おはよう', '2020-11-12 04:04:08.387915', '2020-11-12 04:04:08.387915')

    def show
        @tweet = Tweet.find(params[:id])
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1

    def update
        tweet = Tweet.find(params[:id])
        if tweet.update(tweet_params)
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = 'こんにちは、こんばんは', `tweets`.`updated_at` = '2020-11-12 04:45:18.554819' WHERE `tweets`.`id` = 1

    def destroy
        tweet = Tweet.find(params[:id])
        tweet.destroy
---
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 1